{
  "gene2label": {
    "ABCB1": 0,
    "ABCG2": 1,
    "ABL1": 2,
    "ABL2": 3,
    "ACE": 4,
    "ADORA1": 5,
    "ADORA2A": 6,
    "ADORA2B": 7,
    "ADORA3": 8,
    "ADRA1A": 9,
    "ADRA1B": 10,
    "ADRA1D": 11,
    "ADRA2A": 12,
    "ADRA2B": 13,
    "ADRA2C": 14,
    "ADRB1": 15,
    "ADRB2": 16,
    "AGTR1": 17,
    "AHR": 18,
    "AKT1": 19,
    "AKT2": 20,
    "AKT3": 21,
    "ALDH2": 22,
    "ALK": 23,
    "ALOX5": 24,
    "ANPEP": 25,
    "AR": 26,
    "ARPC2": 27,
    "ATM": 28,
    "ATR": 29,
    "AURKB": 30,
    "AVPR2": 31,
    "AXL": 32,
    "BCL2": 33,
    "BRAF": 34,
    "BTK": 35,
    "CA2": 36,
    "CACNA1C": 37,
    "CASR": 38,
    "CCKAR": 39,
    "CCKBR": 40,
    "CDK1": 41,
    "CDK2": 42,
    "CDK4": 43,
    "CDK5": 44,
    "CDK6": 45,
    "CDK7": 46,
    "CDK9": 47,
    "CFTR": 48,
    "CHRM1": 49,
    "CHRM2": 50,
    "CHRM3": 51,
    "CHRM4": 52,
    "CHRM5": 53,
    "CNR1": 54,
    "COMT": 55,
    "CRBN": 56,
    "CSF1R": 57,
    "CYP17A1": 58,
    "CYP19A1": 59,
    "CYP1A2": 60,
    "CYP2A6": 61,
    "CYP2B6": 62,
    "CYP2C19": 63,
    "CYP2C8": 64,
    "CYP2C9": 65,
    "CYP2E1": 66,
    "CYP3A4": 67,
    "CYP3A5": 68,
    "CYP51A1": 69,
    "DHFR": 70,
    "DNMT1": 71,
    "DNMT3A": 72,
    "DNMT3B": 73,
    "DRD2": 74,
    "DRD3": 75,
    "DRD4": 76,
    "EDNRA": 77,
    "EDNRB": 78,
    "EGFR": 79,
    "EGR1": 80,
    "EIF4E": 81,
    "ELANE": 82,
    "EPAS1": 83,
    "EPHA2": 84,
    "EPHB2": 85,
    "EPHB4": 86,
    "ERBB2": 87,
    "ESR1": 88,
    "F10": 89,
    "FER": 90,
    "FGFR1": 91,
    "FGFR2": 92,
    "FGFR3": 93,
    "FGFR4": 94,
    "FKBP1A": 95,
    "FLT1": 96,
    "FLT3": 97,
    "FLT4": 98,
    "GART": 99,
    "GNRHR": 100,
    "GSK3A": 101,
    "GSK3B": 102,
    "GSTM2": 103,
    "HCK": 104,
    "HCN4": 105,
    "HDAC1": 106,
    "HDAC10": 107,
    "HDAC11": 108,
    "HDAC2": 109,
    "HDAC3": 110,
    "HDAC6": 111,
    "HDAC8": 112,
    "HMGCR": 113,
    "HRAS": 114,
    "HRH1": 115,
    "HSP90AA1": 116,
    "HSP90AB1": 117,
    "HTR2A": 118,
    "HTR2C": 119,
    "HTR3A": 120,
    "HTR6": 121,
    "HTR7": 122,
    "IDO1": 123,
    "IKZF1": 124,
    "IKZF3": 125,
    "IL6": 126,
    "JAK1": 127,
    "JAK2": 128,
    "JAK3": 129,
    "KCNH2": 130,
    "KDR": 131,
    "KIT": 132,
    "KLF4": 133,
    "KLF5": 134,
    "KRAS": 135,
    "LCK": 136,
    "LYN": 137,
    "MAP2K1": 138,
    "MAP2K2": 139,
    "MAP3K7": 140,
    "MAP3K8": 141,
    "MAP4K2": 142,
    "MAP4K4": 143,
    "MAPK1": 144,
    "MAPK10": 145,
    "MAPK11": 146,
    "MAPK14": 147,
    "MAPK3": 148,
    "MAPK7": 149,
    "MAPK8": 150,
    "MAPK9": 151,
    "MAPKAPK2": 152,
    "MET": 153,
    "MMP13": 154,
    "MMP14": 155,
    "MMP7": 156,
    "MMP8": 157,
    "MMP9": 158,
    "MTOR": 159,
    "MYC": 160,
    "NFE2L2": 161,
    "NFKB1": 162,
    "NR3C1": 163,
    "NR3C2": 164,
    "NRAS": 165,
    "NS2B-NS3": 166,
    "NTRK1": 167,
    "NTRK2": 168,
    "NTRK3": 169,
    "NUDT1": 170,
    "ODC1": 171,
    "OPRM1": 172,
    "P2RX2": 173,
    "P2RX3": 174,
    "P2RY12": 175,
    "PAK1": 176,
    "PARP1": 177,
    "PARP2": 178,
    "PARP3": 179,
    "PBK": 180,
    "PDE3A": 181,
    "PDE5A": 182,
    "PDGFRA": 183,
    "PDGFRB": 184,
    "PGR": 185,
    "PIK3CA": 186,
    "PIK3CB": 187,
    "PIK3CD": 188,
    "PIK3CG": 189,
    "PLA2G2A": 190,
    "PLK1": 191,
    "PLK2": 192,
    "PLK3": 193,
    "PPARA": 194,
    "PPARD": 195,
    "PPARG": 196,
    "PPP2CA": 197,
    "PPP2CB": 198,
    "PPP3CA": 199,
    "PPP3CB": 200,
    "PPP3CC": 201,
    "PRKAA1": 202,
    "PRKACA": 203,
    "PRKCA": 204,
    "PRKDC": 205,
    "PRLR": 206,
    "PSMB1": 207,
    "PSMB2": 208,
    "PSMB5": 209,
    "PTGS1": 210,
    "PTGS2": 211,
    "RAF1": 212,
    "RARA": 213,
    "RARB": 214,
    "RARG": 215,
    "REN": 216,
    "RET": 217,
    "ROCK1": 218,
    "ROCK2": 219,
    "ROS1": 220,
    "RPS6KA1": 221,
    "RPS6KA2": 222,
    "RPS6KA3": 223,
    "RPS6KB1": 224,
    "RRM1": 225,
    "RRM2": 226,
    "RXRA": 227,
    "RXRB": 228,
    "RXRG": 229,
    "SCN5A": 230,
    "SIRT1": 231,
    "SLC12A1": 232,
    "SLC12A2": 233,
    "SLC22A1": 234,
    "SLC22A2": 235,
    "SLC5A2": 236,
    "SLC6A4": 237,
    "SMO": 238,
    "SOS1": 239,
    "SP1": 240,
    "SRC": 241,
    "SRD5A2": 242,
    "SSTR1": 243,
    "SSTR2": 244,
    "SSTR3": 245,
    "SSTR5": 246,
    "STAT3": 247,
    "SYK": 248,
    "TACR1": 249,
    "TEK": 250,
    "TLR7": 251,
    "TOP1": 252,
    "TOP2A": 253,
    "TOP2B": 254,
    "TRPA1": 255,
    "TRPC5": 256,
    "TRPM3": 257,
    "TUBA1A": 258,
    "TUBA1B": 259,
    "TUBA1C": 260,
    "TUBB": 261,
    "TUBB1": 262,
    "TUBB2A": 263,
    "TUBB2B": 264,
    "TUBB3": 265,
    "TUBB4A": 266,
    "TUBB4B": 267,
    "TUBB6": 268,
    "TXNRD1": 269,
    "TXNRD2": 270,
    "TYK2": 271,
    "TYMS": 272,
    "ULK1": 273,
    "ULK2": 274,
    "WNV": 275,
    "XDH": 276,
    "XPO1": 277,
    "YAP1": 278,
    "ZAK": 279,
    "ZKSCAN1": 280
  },
  "label2gene": {
    "0": "ABCB1",
    "1": "ABCG2",
    "2": "ABL1",
    "3": "ABL2",
    "4": "ACE",
    "5": "ADORA1",
    "6": "ADORA2A",
    "7": "ADORA2B",
    "8": "ADORA3",
    "9": "ADRA1A",
    "10": "ADRA1B",
    "11": "ADRA1D",
    "12": "ADRA2A",
    "13": "ADRA2B",
    "14": "ADRA2C",
    "15": "ADRB1",
    "16": "ADRB2",
    "17": "AGTR1",
    "18": "AHR",
    "19": "AKT1",
    "20": "AKT2",
    "21": "AKT3",
    "22": "ALDH2",
    "23": "ALK",
    "24": "ALOX5",
    "25": "ANPEP",
    "26": "AR",
    "27": "ARPC2",
    "28": "ATM",
    "29": "ATR",
    "30": "AURKB",
    "31": "AVPR2",
    "32": "AXL",
    "33": "BCL2",
    "34": "BRAF",
    "35": "BTK",
    "36": "CA2",
    "37": "CACNA1C",
    "38": "CASR",
    "39": "CCKAR",
    "40": "CCKBR",
    "41": "CDK1",
    "42": "CDK2",
    "43": "CDK4",
    "44": "CDK5",
    "45": "CDK6",
    "46": "CDK7",
    "47": "CDK9",
    "48": "CFTR",
    "49": "CHRM1",
    "50": "CHRM2",
    "51": "CHRM3",
    "52": "CHRM4",
    "53": "CHRM5",
    "54": "CNR1",
    "55": "COMT",
    "56": "CRBN",
    "57": "CSF1R",
    "58": "CYP17A1",
    "59": "CYP19A1",
    "60": "CYP1A2",
    "61": "CYP2A6",
    "62": "CYP2B6",
    "63": "CYP2C19",
    "64": "CYP2C8",
    "65": "CYP2C9",
    "66": "CYP2E1",
    "67": "CYP3A4",
    "68": "CYP3A5",
    "69": "CYP51A1",
    "70": "DHFR",
    "71": "DNMT1",
    "72": "DNMT3A",
    "73": "DNMT3B",
    "74": "DRD2",
    "75": "DRD3",
    "76": "DRD4",
    "77": "EDNRA",
    "78": "EDNRB",
    "79": "EGFR",
    "80": "EGR1",
    "81": "EIF4E",
    "82": "ELANE",
    "83": "EPAS1",
    "84": "EPHA2",
    "85": "EPHB2",
    "86": "EPHB4",
    "87": "ERBB2",
    "88": "ESR1",
    "89": "F10",
    "90": "FER",
    "91": "FGFR1",
    "92": "FGFR2",
    "93": "FGFR3",
    "94": "FGFR4",
    "95": "FKBP1A",
    "96": "FLT1",
    "97": "FLT3",
    "98": "FLT4",
    "99": "GART",
    "100": "GNRHR",
    "101": "GSK3A",
    "102": "GSK3B",
    "103": "GSTM2",
    "104": "HCK",
    "105": "HCN4",
    "106": "HDAC1",
    "107": "HDAC10",
    "108": "HDAC11",
    "109": "HDAC2",
    "110": "HDAC3",
    "111": "HDAC6",
    "112": "HDAC8",
    "113": "HMGCR",
    "114": "HRAS",
    "115": "HRH1",
    "116": "HSP90AA1",
    "117": "HSP90AB1",
    "118": "HTR2A",
    "119": "HTR2C",
    "120": "HTR3A",
    "121": "HTR6",
    "122": "HTR7",
    "123": "IDO1",
    "124": "IKZF1",
    "125": "IKZF3",
    "126": "IL6",
    "127": "JAK1",
    "128": "JAK2",
    "129": "JAK3",
    "130": "KCNH2",
    "131": "KDR",
    "132": "KIT",
    "133": "KLF4",
    "134": "KLF5",
    "135": "KRAS",
    "136": "LCK",
    "137": "LYN",
    "138": "MAP2K1",
    "139": "MAP2K2",
    "140": "MAP3K7",
    "141": "MAP3K8",
    "142": "MAP4K2",
    "143": "MAP4K4",
    "144": "MAPK1",
    "145": "MAPK10",
    "146": "MAPK11",
    "147": "MAPK14",
    "148": "MAPK3",
    "149": "MAPK7",
    "150": "MAPK8",
    "151": "MAPK9",
    "152": "MAPKAPK2",
    "153": "MET",
    "154": "MMP13",
    "155": "MMP14",
    "156": "MMP7",
    "157": "MMP8",
    "158": "MMP9",
    "159": "MTOR",
    "160": "MYC",
    "161": "NFE2L2",
    "162": "NFKB1",
    "163": "NR3C1",
    "164": "NR3C2",
    "165": "NRAS",
    "166": "NS2B-NS3",
    "167": "NTRK1",
    "168": "NTRK2",
    "169": "NTRK3",
    "170": "NUDT1",
    "171": "ODC1",
    "172": "OPRM1",
    "173": "P2RX2",
    "174": "P2RX3",
    "175": "P2RY12",
    "176": "PAK1",
    "177": "PARP1",
    "178": "PARP2",
    "179": "PARP3",
    "180": "PBK",
    "181": "PDE3A",
    "182": "PDE5A",
    "183": "PDGFRA",
    "184": "PDGFRB",
    "185": "PGR",
    "186": "PIK3CA",
    "187": "PIK3CB",
    "188": "PIK3CD",
    "189": "PIK3CG",
    "190": "PLA2G2A",
    "191": "PLK1",
    "192": "PLK2",
    "193": "PLK3",
    "194": "PPARA",
    "195": "PPARD",
    "196": "PPARG",
    "197": "PPP2CA",
    "198": "PPP2CB",
    "199": "PPP3CA",
    "200": "PPP3CB",
    "201": "PPP3CC",
    "202": "PRKAA1",
    "203": "PRKACA",
    "204": "PRKCA",
    "205": "PRKDC",
    "206": "PRLR",
    "207": "PSMB1",
    "208": "PSMB2",
    "209": "PSMB5",
    "210": "PTGS1",
    "211": "PTGS2",
    "212": "RAF1",
    "213": "RARA",
    "214": "RARB",
    "215": "RARG",
    "216": "REN",
    "217": "RET",
    "218": "ROCK1",
    "219": "ROCK2",
    "220": "ROS1",
    "221": "RPS6KA1",
    "222": "RPS6KA2",
    "223": "RPS6KA3",
    "224": "RPS6KB1",
    "225": "RRM1",
    "226": "RRM2",
    "227": "RXRA",
    "228": "RXRB",
    "229": "RXRG",
    "230": "SCN5A",
    "231": "SIRT1",
    "232": "SLC12A1",
    "233": "SLC12A2",
    "234": "SLC22A1",
    "235": "SLC22A2",
    "236": "SLC5A2",
    "237": "SLC6A4",
    "238": "SMO",
    "239": "SOS1",
    "240": "SP1",
    "241": "SRC",
    "242": "SRD5A2",
    "243": "SSTR1",
    "244": "SSTR2",
    "245": "SSTR3",
    "246": "SSTR5",
    "247": "STAT3",
    "248": "SYK",
    "249": "TACR1",
    "250": "TEK",
    "251": "TLR7",
    "252": "TOP1",
    "253": "TOP2A",
    "254": "TOP2B",
    "255": "TRPA1",
    "256": "TRPC5",
    "257": "TRPM3",
    "258": "TUBA1A",
    "259": "TUBA1B",
    "260": "TUBA1C",
    "261": "TUBB",
    "262": "TUBB1",
    "263": "TUBB2A",
    "264": "TUBB2B",
    "265": "TUBB3",
    "266": "TUBB4A",
    "267": "TUBB4B",
    "268": "TUBB6",
    "269": "TXNRD1",
    "270": "TXNRD2",
    "271": "TYK2",
    "272": "TYMS",
    "273": "ULK1",
    "274": "ULK2",
    "275": "WNV",
    "276": "XDH",
    "277": "XPO1",
    "278": "YAP1",
    "279": "ZAK",
    "280": "ZKSCAN1"
  }
}