{
  "gene2label": {
    "ABCB1": 0,
    "ABL1": 1,
    "ACE": 2,
    "ADRB1": 3,
    "ADRB2": 4,
    "AGTR1": 5,
    "AHR": 6,
    "ALDH2": 7,
    "ALOX5": 8,
    "ANPEP": 9,
    "AR": 10,
    "ARPC2": 11,
    "ATM": 12,
    "ATR": 13,
    "AURKB": 14,
    "AVPR2": 15,
    "BCL2": 16,
    "BRAF": 17,
    "BTK": 18,
    "CA2": 19,
    "CACNA1C": 20,
    "CASR": 21,
    "CCKBR": 22,
    "CFTR": 23,
    "CNR1": 24,
    "COMT": 25,
    "CYP17A1": 26,
    "CYP19A1": 27,
    "CYP3A4": 28,
    "DHFR": 29,
    "DNMT1": 30,
    "DRD2": 31,
    "EGFR": 32,
    "EIF4E": 33,
    "ELANE": 34,
    "EPAS1": 35,
    "EPHB4": 36,
    "ERBB2": 37,
    "ESR1": 38,
    "F10": 39,
    "GNRHR": 40,
    "GSK3B": 41,
    "HCN4": 42,
    "HDAC6": 43,
    "HMGCR": 44,
    "HRH1": 45,
    "KCNH2": 46,
    "KLF5": 47,
    "KRAS": 48,
    "MAP2K1": 49,
    "MAP3K8": 50,
    "MAP4K4": 51,
    "MAPK14": 52,
    "MAPK7": 53,
    "MET": 54,
    "MTOR": 55,
    "NFE2L2": 56,
    "NR3C1": 57,
    "NR3C2": 58,
    "NUDT1": 59,
    "ODC1": 60,
    "OPRM1": 61,
    "P2RY12": 62,
    "PAK1": 63,
    "PBK": 64,
    "PDE3A": 65,
    "PDE5A": 66,
    "PGR": 67,
    "PIK3CA": 68,
    "PPARG": 69,
    "PRKAA1": 70,
    "PRKDC": 71,
    "PRLR": 72,
    "PSMB5": 73,
    "PTGS2": 74,
    "REN": 75,
    "RET": 76,
    "RPS6KB1": 77,
    "SCN5A": 78,
    "SIRT1": 79,
    "SLC5A2": 80,
    "SLC6A4": 81,
    "SMO": 82,
    "SRD5A2": 83,
    "STAT3": 84,
    "TACR1": 85,
    "TLR7": 86,
    "TOP1": 87,
    "TOP2A": 88,
    "TRPA1": 89,
    "TYMS": 90,
    "XDH": 91,
    "XPO1": 92,
    "YAP1": 93
  },
  "label2gene": {
    "0": "ABCB1",
    "1": "ABL1",
    "2": "ACE",
    "3": "ADRB1",
    "4": "ADRB2",
    "5": "AGTR1",
    "6": "AHR",
    "7": "ALDH2",
    "8": "ALOX5",
    "9": "ANPEP",
    "10": "AR",
    "11": "ARPC2",
    "12": "ATM",
    "13": "ATR",
    "14": "AURKB",
    "15": "AVPR2",
    "16": "BCL2",
    "17": "BRAF",
    "18": "BTK",
    "19": "CA2",
    "20": "CACNA1C",
    "21": "CASR",
    "22": "CCKBR",
    "23": "CFTR",
    "24": "CNR1",
    "25": "COMT",
    "26": "CYP17A1",
    "27": "CYP19A1",
    "28": "CYP3A4",
    "29": "DHFR",
    "30": "DNMT1",
    "31": "DRD2",
    "32": "EGFR",
    "33": "EIF4E",
    "34": "ELANE",
    "35": "EPAS1",
    "36": "EPHB4",
    "37": "ERBB2",
    "38": "ESR1",
    "39": "F10",
    "40": "GNRHR",
    "41": "GSK3B",
    "42": "HCN4",
    "43": "HDAC6",
    "44": "HMGCR",
    "45": "HRH1",
    "46": "KCNH2",
    "47": "KLF5",
    "48": "KRAS",
    "49": "MAP2K1",
    "50": "MAP3K8",
    "51": "MAP4K4",
    "52": "MAPK14",
    "53": "MAPK7",
    "54": "MET",
    "55": "MTOR",
    "56": "NFE2L2",
    "57": "NR3C1",
    "58": "NR3C2",
    "59": "NUDT1",
    "60": "ODC1",
    "61": "OPRM1",
    "62": "P2RY12",
    "63": "PAK1",
    "64": "PBK",
    "65": "PDE3A",
    "66": "PDE5A",
    "67": "PGR",
    "68": "PIK3CA",
    "69": "PPARG",
    "70": "PRKAA1",
    "71": "PRKDC",
    "72": "PRLR",
    "73": "PSMB5",
    "74": "PTGS2",
    "75": "REN",
    "76": "RET",
    "77": "RPS6KB1",
    "78": "SCN5A",
    "79": "SIRT1",
    "80": "SLC5A2",
    "81": "SLC6A4",
    "82": "SMO",
    "83": "SRD5A2",
    "84": "STAT3",
    "85": "TACR1",
    "86": "TLR7",
    "87": "TOP1",
    "88": "TOP2A",
    "89": "TRPA1",
    "90": "TYMS",
    "91": "XDH",
    "92": "XPO1",
    "93": "YAP1"
  }
}